# 3. Необходимо реализовать генератор, возвращающий кортежи вида (<tutor>, <klass>), например:
# ('Иван', '9А')
# ('Анастасия', '7В')
# ...
# Количество генерируемых кортежей не должно быть больше длины списка tutors. Если в списке klasses меньше элементов,
# чем в списке tutors, необходимо вывести последние кортежи в виде: (<tutor>, None), например:
# ('Станислав', None)
#
# ### Доказать, что вы создали именно генератор. Проверить его работу вплоть до истощения.
# Подумать, в каких ситуациях генератор даст эффект.
from write_gen import print_gen

tutors = ['Иван', 'Анастасия', 'Петр', 'Сергей', 'Дмитрий', 'Борис', 'Елена']
# klasses = ['9А', '7В', '9Б', '9В', '8Б', '10А', '10Б', '9А']
klasses = ['9А', '7В', '9Б', '9В', '8Б']


def func_gen(tut, kls):
    return ((tut[i], kls[i] if i < len(kls) else None) for i in range(len(tut)))


# Инициализация генератора
gen_res = func_gen(tutors, klasses)
# Доказательство, что это генератор
print(type(gen_res), '\n')

# Вывод значений генератора
print_gen(gen_res)
